{"class_name": "Sequential", "keras_version": "2.2.4", "config": {"layers": [{"class_name": "Lambda", "config": {"dtype": "float32", "name": "lambda_1", "batch_input_shape": [null, 299, 299, 3], "output_shape": null, "output_shape_type": "raw", "function": ["4wEAAAAAAAAAAQAAAAIAAABDAAAAcwwAAAB8AABkAQAbZAIAGFMpA07nAAAAAADgb0DnAAAAAAAA\n4D+pACkB2gF4cgMAAAByAwAAAPoIdHJhaW4ucHnaCDxsYW1iZGE+egAAAHMAAAAA\n", null, null], "trainable": true, "function_type": "lambda", "arguments": {}}}, {"class_name": "Conv2D", "config": {"data_format": "channels_last", "kernel_regularizer": null, "activity_regularizer": null, "activation": "relu", "bias_constraint": null, "strides": [1, 1], "filters": 24, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_constraint": null, "use_bias": true, "dilation_rate": [1, 1], "bias_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "mode": "fan_avg", "seed": null}}, "trainable": true, "kernel_size": [5, 5], "name": "conv2d_95", "padding": "valid"}}, {"class_name": "MaxPooling2D", "config": {"data_format": "channels_last", "trainable": true, "strides": [4, 4], "pool_size": [4, 4], "name": "max_pooling2d_5", "padding": "valid"}}, {"class_name": "Conv2D", "config": {"data_format": "channels_last", "kernel_regularizer": null, "activity_regularizer": null, "activation": "relu", "bias_constraint": null, "strides": [1, 1], "filters": 36, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_constraint": null, "use_bias": true, "dilation_rate": [1, 1], "bias_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "mode": "fan_avg", "seed": null}}, "trainable": true, "kernel_size": [5, 5], "name": "conv2d_96", "padding": "valid"}}, {"class_name": "MaxPooling2D", "config": {"data_format": "channels_last", "trainable": true, "strides": [4, 4], "pool_size": [4, 4], "name": "max_pooling2d_6", "padding": "valid"}}, {"class_name": "Conv2D", "config": {"data_format": "channels_last", "kernel_regularizer": null, "activity_regularizer": null, "activation": "relu", "bias_constraint": null, "strides": [1, 1], "filters": 48, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_constraint": null, "use_bias": true, "dilation_rate": [1, 1], "bias_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "mode": "fan_avg", "seed": null}}, "trainable": true, "kernel_size": [5, 5], "name": "conv2d_97", "padding": "valid"}}, {"class_name": "MaxPooling2D", "config": {"data_format": "channels_last", "trainable": true, "strides": [4, 4], "pool_size": [4, 4], "name": "max_pooling2d_7", "padding": "valid"}}, {"class_name": "Flatten", "config": {"data_format": "channels_last", "trainable": true, "name": "flatten_1"}}, {"class_name": "Dropout", "config": {"rate": 0.6, "trainable": true, "name": "dropout_1", "noise_shape": null, "seed": null}}, {"class_name": "Dense", "config": {"kernel_regularizer": null, "activity_regularizer": null, "activation": "relu", "bias_constraint": null, "bias_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_constraint": null, "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "mode": "fan_avg", "seed": null}}, "trainable": true, "name": "dense_1", "units": 2000}}, {"class_name": "Dropout", "config": {"rate": 0.6, "trainable": true, "name": "dropout_2", "noise_shape": null, "seed": null}}, {"class_name": "Dense", "config": {"kernel_regularizer": null, "activity_regularizer": null, "activation": "relu", "bias_constraint": null, "bias_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_constraint": null, "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "mode": "fan_avg", "seed": null}}, "trainable": true, "name": "dense_2", "units": 100}}, {"class_name": "Dropout", "config": {"rate": 0.6, "trainable": true, "name": "dropout_3", "noise_shape": null, "seed": null}}, {"class_name": "Dense", "config": {"kernel_regularizer": null, "activity_regularizer": null, "activation": "linear", "bias_constraint": null, "bias_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_constraint": null, "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "mode": "fan_avg", "seed": null}}, "trainable": true, "name": "dense_3", "units": 4}}, {"class_name": "Lambda", "config": {"function_type": "lambda", "output_shape": null, "trainable": true, "output_shape_type": "raw", "function": ["4wEAAAAAAAAAAQAAAAIAAABDAAAAcxMAAAB0AABqAQBqAgBqAwB8AACDAQBTKQFOKQTaAUvaAnRm\n2gJubtoHc29mdG1heCkB2gF4qQByBgAAAPoIdHJhaW4ucHnaCDxsYW1iZGE+jQAAAHMAAAAA\n", null, null], "name": "lambda_2", "arguments": {}}}], "name": "sequential_1"}, "backend": "tensorflow"}